[
  {
    "id": 1,
    "name": "Cat x Machine",
    "details": {
      "title": "Cat x Machine",
      "description": "Browser-based game developed with <strong>HTML, CSS, JavaScript, DOM manipulation, and Object-Oriented Programming (OOP)</strong>. Cat X Machine is a simple web-based game where you control a cat character, attempting to avoid machines while collecting snacks to gain lives. Click on the <strong>'Live'</strong> button and use the keyboard to control the cat's jumping and crouching movements.",
      "technologies": ["CSS", "JavaScript", "HTML", "DOM manipulation", "OOP"],
      "video": "/projectPagePhotos/CatxMachine.mp4",
      "photo": "/projectPagePhotos/CatXMachine.png",
      "live": "https://marcela-rocha-martins.github.io/project-game-catXmachine/",
      "github": "https://github.com/Marcela-Rocha-Martins/project-game-catXmachine"
    }
  },
  {
    "id": 2,
    "name": "AnchorNaut",
    "details": {
      "title": "AnchorNaut",
      "description": "Anchornaut is a full-stack project that empowers you to turn your wildest dreams into achievable and concrete personal projects. The platform leverages the <strong>OpenAI GPT (Generative Pre-trained Transformer) </strong> chat API to create a dynamic system where users can input their dreams, and the AI generates tasks and subtasks to help bring those dreams to life.<br/><br/>The project includes both a backend and a front-end component. Anchornaut utilizes <mark style='background-color:#D1D8CE'>MongoDB as its database, Node.js and Express.js on the server-side to provide a solid foundation. Security is reinforced with JSON Web Tokens (JWT) and bcrypt for authentication</mark>. Integration with OpenAI enables task generation based on user input.<br/><br/>On the frontend, React is the primary library for interface construction, with React Router Dom and React hooks for routing and state management. HTTP requests are efficiently handled with Axios. For more details, check out the GitHub repository.</br></br><mark style='background-color:#D1D8CE'>Important note ⚠️</mark></br></br>I had very little experience with React and limited time to develop the project when I did it. (We had about a week to do everything.) So, I need to be honest and admit that there are several mistakes in this project, along with areas for improvement that I would like (and will) work on to refine my work.</br></br>Here's a list of them:</br></br>Errors:</br></br><strong>1.</strong>The code is repetitive and verbose. I definitely wasn't a Clean Code enthusiast here, and I'm trying to improve on smaller projects I've taken on since then.</br></br><strong>2.</strong>For some reason (that only past Marcela understands), some classes are nameless, with styling code directly in the component. Changing this is in my plans.</br></br><strong>3.</strong>There are authentication issues for users that persist in the deployment. I'm still struggling to figure out how to solve them.</br></br>Beyond the errors, I need to say that given the time I had, the bold idea, and the knowledge at that time, it was a miracle to deliver the project. I'm studying and improving to fix the errors and be proud of the code behind this project with such a cool idea. 🚀",
      "technologies": [
        "JS",
        "CSS",
        "React",
        "MongoDB",
        "Node & Express",
        "JWT"
      ],
      "video": "/projectPagePhotos/projectVideo.mov",
      "photo": "/projectPagePhotos/Anchornaut.png",
      "live": "https://anchornaut.netlify.app/",
      "github": "https://github.com/Marcela-Rocha-Martins/AnchorNaut-client"
    }
  },
  {
    "id": 3,
    "name": "Code Pen",
    "details": {
      "title": "Code Pen",
      "description": "Exercises and features",
      "technologies": ["CSS", "JavaScript", "HTML"],
      "video": "/projectPagePhotos/VideoTeste.mp4",
      "photo": "/projectPagePhotos/CodePen6.png",
      "live": "https://github.com/Marcela-Rocha-Martins/project-game-catXmachine/",
      "github": "https://marcela-rocha-martins.github.io/project-game-catXmachine/"
    }
  },
  {
    "id": 4,
    "name": "Feed",
    "details": {
      "title": "Feed",
      "description": "This marks my inaugural React project, crafted with <strong>TypeScript</strong>, as I embark on a journey into the world of static typing features. The project aims to simulate a social media feed reminiscent of Twitter.<br><br> Given my initial and ongoing exploration of this type of language, the application remains relatively straightforward. It enables users to applaud comments and facilitates dynamic interaction. ",
      "technologies": ["CSS", "Typescript", "HTML", "React", "Vite"],
      "video": "/projectPagePhotos/feedvideo.mov",
      "photo": "/projectPagePhotos/feedphoto.png",
      "live": "https://react-project1-feed-typescript-dxvea8txu.vercel.app/",
      "github": "https://github.com/Marcela-Rocha-Martins/react-project1-feed-typescript"
    }
  },
  {
    "id": 5,
    "name": "My Portfolio",
    "details": {
      "title": "My Portfolio",
      "description": "The rumor is you need a portfolio to land your first web development job. So, naturally, I thought, why not? 🤷‍♀️</br></br>But here's the thing, instead of the usual stuff, I decided to spice things up by mimicking operating systems like Mac, LinkedIn, and email. This way, I could have something to inspire my design (initially conceptualised by my husband and refined through a few of my own tweaks). It also provides something a bit different to show.</br></br><mark style='background-color:#D1D8CE'>We used <strong>Figma</strong> to facilitate the communication between design and styling in programming. The project was built using React, CSS, and Javascript.</mark> For window dragging, I incorporated a React package called <strong>Draggable.</strong></br></br>There's still A LOT to be improved, but I'm thrilled with the outcome!😊",
      "technologies": ["CSS", "JavaScript", "HTML", "React"],
      "photo": "/projectPagePhotos/MyPortfolio.png",
      "live": "https://marcelarochamartins-webdev.vercel.app/",
      "github": "https://github.com/Marcela-Rocha-Martins/portfolio"
    }
  },
  {
    "id": 6,
    "name": "Timer",
    "details": {
      "title": "Timer",
      "description": "This project provides a simple interface with two pages centered around a timer functionality. Users can set tasks and durations, and the app will manage and display the timers accordingly. Additionally, the app keeps track of previous timers in the 'archive' tab, allowing users to access their history of previous timers.",
      "technologies": ["CSS", "Typescript", "HTML", "React", "Vite"],
      "video": "/projectPagePhotos/timervideo.mov",
      "photo": "/projectPagePhotos/timerphoto.png",
      "live": "https://react-project2-timer-typescript-7n43rb9ag.vercel.app/",
      "github": "https://github.com/Marcela-Rocha-Martins/react-project2-timer-typescript"
    }
  }
]
